
#Описати функцію TrianglePS (a, P, S), яка обчислює по стороні a рівностороннього
#трикутника його периметр P = 3 · a і площу S = a2
#· (3) 1/2/4 (де a - вхідний, P і S -
#вихідні параметри; всі параметри є дійсними). За допомогою цієї функції знайти
#периметри і площі трьох рівносторонніх трикутників з даними сторонами.
def triangle_ps(side: float) -> (float, float):
    return side *3, side **2 * ( 3**.5)/4

print('сторона a = 2 ,P={}, S={}'.format(*triangle_ps(2)))
print('сторона a = 3  ,P={}, S={}'.format(*triangle_ps(3)))
print('сторона a = 4 ,P={}, S={}'.format(*triangle_ps(4)))